math_syllabus.org
#+HTML_HEAD: <style type="text/css">body{ max-width: 800px; font-size: x-large; }</style>
#+HTML_MATHJAX: scale: 100 align: left indent: 0em tagside: left font: Cambria
#+HTML_MATHJAX: cancel.js noErrors.js

#+TITLE: Mathematics in Game Development  
#+AUTHOR: Patrick Collin Eye
#+EMAIL: ceye@dcccd.edu

# Documentation for latex/mathjax commands in org
# https://orgmode.org/mathjax/docs/html/tex.html

* Course Description
  This is an overview and introduction to the fundamental math you need for game development. 
  We do not go in depth on many topics. 
  The goal isn't to teach you everything you'll ever need to know. It's to introduce you to a lot of topics in the field which you can go more in depth when needed. I want you to have the tools you study more on your own, and to figure out how to solve problems. 
  We'll learn some algebra, geometry, trigonometry, and linear algebra. These are all entire fields of mathematics. 

  Usually in games we encounter unique and specific problems, so you can't just plug in solutions. Part of your job as a game programmer is being able to do the math to solve problems.

  Game developers often have to read up on a specific topic. This means researching, finding and reading mathematical papers.
* Intro
  Math is everywhere. 
  "The unreasonable effectiveness of mathematics in the natrual sciences."
  There is no agreed upon undertsanding of what math is. Some people say that it's a description of how the universe works, but that doesn't mean there is any math actually going on. It's just a language which is suited to describing the types of things that do happen. It's like describing colors. We know that the color of a rose is because it absorbs all other lightwaves. Calling it red is a conveinent and expressive way to describe that process. 
  Another school of thought is that yes, there are definitely mathematical processes going on. 

  While this is very profound, interesting, and important stuff, we'll stick with a more meager defintion: Math is one of the tools that programmers use to express game design. 
  What's interesting about this is that whether or not math merely describes, or actually determines the world, in a computer program, it most definitely determines it. 
* Arithmetic
  We have 4 basic operations
  Addition
  Subtraction
  Multiplication
  Division

  Order of operations! PEMDAS. This is a convention that everyone adheres to about what order to do operations in. 
  I try to be very explicit about specifying the order that I want operations to happen in. 
  Parentheses
  Exponents
  Multiplication
  Division
  Addition
  Subtraction

  Types of numbers:
  - Whole/natural numbers
  \begin{equation}
  (0, 1, 2, 3 ...)
  \end{equation}
  - Integers: 
  \begin{equation}
  (... -3, -2, -1, 0, 1, 2, 3, ...)
  \end{equation}
  - Real numbers: 
  \begin{equation}
  (-1001, ... -3.145, ... -0.1001, ... 0a ... 0.999, ... 1, ... 2.71828, ...)
  \end{equation}


  We will primarily be dealing with real numbers because games are continuous in space and not discrete. (go into a bit of history about real numbers). 
  Whole numbers do come up a lot when we are talking about the number of elements of something, a specific instnace of something, and so on. 

** Powers
  Raising a number N to a power M means to multiply N by itself M times.
  \begin{equation}
  2^{3} = 2 * 2 * 2 = 8
  \end{equation}  

  A number raised to the 0 power always equals 1. 

  A number raised to the 1 power always equals itself.

  Raising a number N to a power -M 
** Roots
* Variables
  In math and programming we use variables to refer to values and expressions. 
  A value is just a number. 
  An expression is a series of operations. 2 + 2, 0 - 1, 8 * 3, 9 / 2, are all expressions

  A variable is a representation or name used to represent a value.

  In math we never have a variable that equals two different things. Once it's value is stated, it never changes. 

  To make a variable we simply write the name, an equals sign, and then a value 
  x = 1001
  y = 9
  n = 256

Usually we use single letters for variables in math, but often in programming we use names, because what we're representing is not abstract, but concrete. 

* Equations
  Equations are statements saying that something is true. 
  The simplest equation would be something like 

  The simplest type of equation is once that we can compute, and determine it's truthfullness based on the value produced. 
  2 + 2 = 4 
  0 - 1 = -1

  Other examples
  \begin{equation}
  x = 2 * 2 * 2
  \end{equation}
  \begin{equation}
  y = 1 + \frac{2}{3}
  \end{equation}

  The two main things equations are used for: 
    To produce a value given certain inputs. This is called a function. They are written like f(x) = ...
      -- (do I want to harp on the every input must produce unique output?) )
      These are really useful for things like "want something to change like this over time"
      "This is how much health to take away if my armor is x and their damage is y"
    To solve and figure out the desired value (this can be used for things like "if my character is moving this fast, and I want a character to catch him in 10 seconds if he's this far away, how fast should my character go?)
      What is the distance between two points in space (characters, items, UI elements, etc)
      $ MORE OBVIOUS EXAMPLES

  

  You can do operations on an equation, but anything you do to one side of the equation you must do to the other. Otherwise it will no longer be the same equation. 
  These are known as "reciprocal operations" and let you rephrase/rearrange your problem. 

  Parametric Equations: These assign an function to each parameter. We use these a lot in games. 
  Example: when spawning enemies you want them to appear in a circle around a certain point. You would define their x and y position with the cos and sin functions respectively.

  An equation can have more than one unknown. 

** Solving Equations
* Cartesian Coordinates
  Just like we have a number line for 1 dimension, we can create two perpendicular number lines.
* Unit Circle / Trig
  Trig is most useful in 2 dimensions. Linear algebra is amuch more useful tool for dealing with 3D gemoetry. But a lot of problems in games can actually be reduced to 2 dimensions, at which point trig becomes very useful again. Example: turning a 3D model of a character. It's true that our game is 3D, but the rotation of our character's body is essentially 2D: they're on a flat surface, and they are always oriented upright. So we can use trig to find the radians about their upright vector to turn the character. Being able to express a problem in simpler, more confined terms is usually a good thing. 
* Percentages and Interpolation
* Linear Algebra
  Addition & Subtraction & Scaling
  Length
  Normalizing vectors
  Dot product
  Cross Product
  Project onto line
  Projection matrix
  Coordinate systems
  Homogeneous matrices
  Quaternions (rotating a direction)
  

  \begin{equation*}
    v = 
    \begin{bmatrix}
    x \\
    y \\
    z \\
    \end{bmatrix}
  \end{equation*}

  

