math_syllabus.tex



\subsection{Dot Product}
\label{sec-9-1}
The dot product is a very common and useful operation in game development. The dot product of two vectors is a scalar value. One way to think about this scalar is that it represents the differece in direction between the two vectors.

We use the \( \cdot \) operator to represent the dot product.

In terms of arithmetic, the dot product is the sum of each component of one vector, multilpied by the corresponding component of another vector. 

If A and B are 2D vectors then

\begin{equation*}
  A \cdot B = (A_x \times B_x) + (A_y \times B_y)
\end{equation*}

And of course in 3 dimensions you just also had the product of the \(z\) components.

\begin{equation*}
  A \cdot B = (A_x \times B_x) + (A_y \times B_y) + (A_z \times B_z)
\end{equation*}

As the angle between the vectors \(\theta\) increases, we will be scaling \( \lVert A \rVert \lVert B \rVert \) by a smaller and smaller value, until the angle is \(\ang{90}\), at which point \(cos(\theta)\) = 0. As \(\theta\) increases past \(\ang{90}\), \(cos(\theta) < 0\), and our value is now negative, meaning that the two vectors point in different directions.

But it gets better! We can do some algebra to find out what the angle between those vectors is.
  \begin{equation*}
  \theta = arccos\left( \frac{P \cdot Q}{\lVert P \rVert \lVert Q \rVert} \right)
  \end{equation*}
  
\subsubsection{Problems}
\label{sec-9-1-1}
\subsection{Matrices}
\label{sec-9-2}
A matrix multiplied by a vector produces a new vector. We say that it "transforms" that vector.

We call this linear, because any point along the same line as the input vector will map to a point along the same line as the output vector. This Transformation is \textbf{big deal}

Using a particular matrix, we can transform a point in 3D space onto a 2 dimensional surface. That 2D surface is a screen. 

EXPLAIN WHAT A LINEAR TRANSFORMATION IS AS OPPOSED TO AN ARBITRARY TRANSFORMATIONS: parallel lines remain parallel

We can say that our vector is how how many units to move along our basis vectors \( \hat{i} \) and \( \hat{j} \)

Let's put our basis vectors into a matrix

\begin{equation*}
  I = 
  \begin{bmatrix}
  1 & 0 \\
  0 & 1 \\
  \end{bmatrix}
\end{equation*}

This is known as an Identity matrix because if we multiply any vector by this matrix, we'll get the same vector, just 

\begin{equation}   
N * 1 = N
\begin{end}   

\begin{equation}   
I * V = V
\begin{end}   

To see how this works let's see how we multiply a vector by a matrix. 

\begin{equation*}
  \begin{bmatrix}
  a & c \\
  b & d \\
  \end{bmatrix}

  * 

  \begin{bmatrix}
  x \\
  y \\
  \end{bmatrix}

  = 
  
  \begin{bmatrix}
  x * a + y * c \\
  x * b + y * d \\
  \end{bmatrix}
  
\end{equation*}

Algorithmically you can think of this process as taking each row of our matrix M, and multiplying it by our vector V. The Nth row of $\prime$\{V\} = the nth row of M * V.

Another way to visualize this is:

\begin{equation*}
     \begin{bmatrix}
     a & c \\
     b & d \\
     \end{bmatrix}

     * 

     \begin{bmatrix}
     x \\
     y \\
     \end{bmatrix}

     = 

     x * 
     \begin{bmatrix}
     a \\
     b \\
     \end{bmatrix}

     +

     y * 
     \begin{bmatrix}
     c \\
     d \\
     \end{bmatrix}
   \end{equation*}

Plugging in the values of our matrix I we can see that it doesn't change the vector at all. 

\begin{equation*}
  \begin{bmatrix}
  1 & 0 \\
  0 & 1 \\
  \end{bmatrix}

  * 

  \begin{bmatrix}
  x \\
  y \\
  \end{bmatrix}

  = 
  
  \begin{bmatrix}
  x * 1 + x * 0 \\
  y * 0 + y * 1 \\
  \end{bmatrix} 

  =
  
  \begin{bmatrix}
  x \\
  y \\
  \end{bmatrix}

\end{equation*}


Let's look at how to rotate a vector by 90 degrees using a matrix. First let's see what our basis vectors are if we rotate them by 90 degrees. 

\begin{equation*}
     \begin{bmatrix}
     0 & -1 \\
     1 & 0 \\
     \end{bmatrix}
\end{equation*}

Notice that our \( \hat{i} \) vector is vertical, and our \( \hat{j} \) is horizontal.

Now if we have a vector 

\begin{equation*}
     v = 
     \begin{bmatrix}
     1 \\
     1 \\
     \end{bmatrix}
 \end{equation*}

We can plug the numbers in and do our multiplication, OR we can just visualize is. We'll take V and move it up 1, and then left 1. 

EXPLAIN THE RELATIONSHIP BETWEEN THIS AND THE UNIT CIRCLE: 

Why is it that the values when rotated by 90 degrees are (0, 1) and (-1, 0) respectively? Think about our unit circle. What is are the two functions that represent our (x, y) positions on the unit circle? So we can define parts of our rotation matrix as functions which take a value. And then we plug in our radians to get the values of each vector.

\begin{equation*}
     \begin{bmatrix}
     cos(\theta) & -sin(\theta) \\
     sin(\theta) & \cos(\theta) \\
     \end{bmatrix}
\end{equation*}

To verify this let's plug in our radians for 90 degrees: $\pi$ / 2

   \begin{equation*}
     \begin{bmatrix}
     0 & -1 \\
     1 & 0 \\
     \end{bmatrix}
\end{equation*}

SCALING

What if we want to scale a vector so that it is twice as long?


Becaues we're programmers we really aren't manually rotating matrices very often. It's useful to know how to do it, so you can write a function that does it for you, or solve a problem by hand if you really need to (and you might), but this visualization is something that we do all the time. 
