math_syllabus.org
*** Problems
    1) Make a matrix that represents your basis vectors rotated 180 degrees. 

    2) Make a matrix that represents your basis vectors rotated 45 degrees. How would you find out the values of different vectors (hint: unit circle)

    3) Let's say you have a point in quadrant 3. You want to rotate it so it's in quadrant 1. Find a matrix that you could apply to rotate it into that quadrant.

    4) Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
    \begin{equation*}
    \begin{bmatrix}
    0.7853 & -0.7853\\
    0.7853 & 0.7853\\
    \end{bmatrix}
    \end{equation*}

    4) Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
    \begin{equation*}
    \begin{bmatrix}
    2 & 0\\
    0 & 2\\
    \end{bmatrix}
    \end{equation*}

    5) Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
    \begin{equation*}
    \begin{bmatrix}
    1 & 0\\
    0 & 2\\
    \end{bmatrix}
    \end{equation*}

    6) Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
    \begin{equation*}
    \begin{bmatrix}
    4 & 0\\
    0 & 1\\
    \end{bmatrix}
    \end{equation*}
    
7) Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
    \begin{equation*}
    \begin{bmatrix}
    0.25 & 0\\
    0 & 0.5\\
    \end{bmatrix}
    \end{equation*}

# Reflection about Y    
8) Draw 4 points on a graph representing a square. Multiply each point by this matrix. Make sure to label each point, and in the graph before and after. What happened to that square?
    \begin{equation*}
    \begin{bmatrix}
    -1 & 0\\
    0 & 1\\
    \end{bmatrix}
    \end{equation*}
    
# rotation by 180 degrees
   8) Draw 4 points on a graph representing a square. Multiply each point by this matrix. Make sure to label each point, and in the graph before and after. What happened to that square?
    \begin{equation*}
    \begin{bmatrix}
    -1 & 0\\
    0 & -1\\
    \end{bmatrix}
    \end{equation*}
    
** Matrices Part 2
Part2: composing matrix transformations. Matrix multiplication
   SCALING & ROTATING
   
   Our matrix might have values such that it rotates, and scales the vector
   \begin{equation*}
    \begin{bmatrix}
    0 & -2\\
    -2 & 0\\
    \end{bmatrix}
    \end{equation*}

    Notice that this matrix will not only rotate our by 90 degrees, but it also scales it by 2. This is a really powerful idea, because it means we can pack multiple transformations into a single vector. 

    Not only can we pack everything into one matrix, but we can add concatenate transformations into that matrix by multiplying N matrices together. So we may have a matrix that scales a vector. But then we ight 

   

   # VECTOR (make this an emacs function)
   \begin{equation*}
     v = 
     \begin{bmatrix}
     x \\
     y \\
     z \\
     \end{bmatrix}
   \end{equation*}

   Part 2: 
   Homogeneous vector, and packing multiple transformations into a single matrix. 

   Part 4: 3D transformations

** Solving equations
   We can take multiple equations, put the coefficients into a matrix, and the variables into the input vector, and the righthandside of the equations into the output vector.

   To solve this we need to find which input vector this matrix maps to the output vector. We get this by applying the inverse matrix to the output vector.
   Finding an inverse of an arbitrary matrix is expensive. 
   
   \begin{equation*}
   A = 
   \begin{bmatrix}
   1 & 2 & 3 \\
   4 & 5 & 6 \\
   7 & 8 & 9
   \end{bmatrix}
   \end{equation*}
** Eigenvector
   Any vector which is only scaled when multiplied by a matrix M is called an Eigenvector of that matrix. How much its scaled by is called the Eigenvalue
* 3D geometry
  Planes
  Line
  Rays
  Vertices
  Collision Detection: point-shape, line-shape, line-line, shape-shape intersection. Closest points on line, on shape
* Calculus
  Limits
  Derivative
  Integral
  Fundamental Theorem of Calculus
* Discrete Mathematics
  Games simulate continuous motion by displaying a series of discrete frames quickly. Everything that happens in a game, under the hood, is discrete. We simulate at time t, then draw the results, then simulate at time t2. Even tho the equation may be continuous, we are simulating it in discrete chunks. 
  Example: if an object is moving to the right with velocity 60, and our FPS is 60, then it will move 1 unit every frame. That means if we frame-stepped our game we would see it teleport between coordinate 0 & 1, 1 & 2, etectera
  This does not seem to be the way the world really works (?)
* Algorithms
  In programming we are making defining processes that happen over time. The description or rules of a process are called an algorithm. We're all familiar with algorithms in our daily life: how to bake a cake is an algorithm because it gives instructions of what steps to execute to produce the desired output. 
  
  Thinking in terms of algorithms is important for game programmers because we are dealing with complex systems and the desired outcome is ususally many steps away. Math is one of the tools we use to describe the operations we want to perform, but it is ususally not as simple as doing one thing. 
  
  Example: you have an NPC who you want to rotate to face an object. You can describe mathematically how much you want him to turn. You can even describe how much you want him to turn every frame, so that it happens over time. But you also need to figure out when he should start facing an object; for how long he should face it; how he picks the object to face, and so on.

  There are a two basic tools that programmers use to create algorithms.
  
  - Conditionals :: This is a way to specify if some instruction should be carried out based on a condition being satisfied (meaning that it is true). Usually these are written using "if" and "else". 

    *Example*: In a recipe you don't put the cake in the oven until the temperature is 400 degrees.

  - Loops :: This is a way to specify that we want an instruction carried out N times, or until a certain condition is satisfied.

    *Example 1*: take 3 eggs and crack them into a bowl. 
    
    *Example 2*: 
    1) Put a slice of bacon in the pan. 
    2) /IF/ there is room, goto step 1)
 
  Often we will write algorithms with numbers next to the step so that we can refer to a step with a number, and issue instructions like "goto intsruction N".
  
  Let's look at an example of a cake recipe to see an algorithm:
  
  1) Get a bowl, 3 eggs, flour, sugar, and butter
  2) /LOOP/:
     - Take an egg and put in the bowl
     - /IF/ there are less than 3 eggs in the bowl, goto step 2)
  3) Put 2 cups of flower in the bowl.
  4) Put 1 stick of butter in the bowl.
  5) Preheat the oven to 400 degrees.
  6) /IF/ the oven is not 400 degrees, goto step 8)
  7) Put the bowl in the oven.
  8) Wait.
  9) /IF/ it has been 30 minutes, goto step 10). /ELSE/ goto step 8)
  10) Take the cake out of the oven.
   
  An algorithm that underlies all games is this:
  
  1) /LOOP/:
     - GetInput()
     - Simulate()
     - Render()
     - /IF/ game-over goto 2)
     - /ELSE/ goto step 1)
  2) Close the game.

# C-c ' to edit source-code 
#+BEGIN_SRC C
  int main() {
      printf("Hello World 0123");
  }
#+END_SRC
* Probability
  LOST ALL THIS DATA FUCK!
{this is the only example I've found where P(A | B) doesn't just wind up being P(A). The fact that they are almost always the same is really not intuitive to me. }

