math_syllabus.tex

\subsubsection{Problems}
\label{sec-9-2-1}
\begin{enumerate}
\item Make a matrix that represents your basis vectors rotated 180 degrees.

\item Make a matrix that represents your basis vectors rotated 45 degrees. How would you find out the values of different vectors (hint: unit circle)

\item Let's say you have a point in quadrant 3. You want to rotate it so it's in quadrant 1. Find a matrix that you could apply to rotate it into that quadrant.

\item Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
\end{enumerate}
\begin{equation*}
\begin{bmatrix}
0.7853 & -0.7853\\
0.7853 & 0.7853\\
\end{bmatrix}
\end{equation*}

\begin{enumerate}
\item Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
\end{enumerate}
\begin{equation*}
\begin{bmatrix}
2 & 0\\
0 & 2\\
\end{bmatrix}
\end{equation*}

\begin{enumerate}
\item Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
\end{enumerate}
\begin{equation*}
\begin{bmatrix}
1 & 0\\
0 & 2\\
\end{bmatrix}
\end{equation*}

\begin{enumerate}
\item Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
\end{enumerate}
\begin{equation*}
\begin{bmatrix}
4 & 0\\
0 & 1\\
\end{bmatrix}
\end{equation*}

\begin{enumerate}
\item Draw 4 points on a graph representing a square. Multiply each point by this matrix. What happened to that square?
\begin{equation*}
\begin{bmatrix}
0.25 & 0\\
0 & 0.5\\
\end{bmatrix}
\end{equation*}
\end{enumerate}

\begin{enumerate}
\item Draw 4 points on a graph representing a square. Multiply each point by this matrix. Make sure to label each point, and in the graph before and after. What happened to that square?
\begin{equation*}
\begin{bmatrix}
-1 & 0\\
0 & 1\\
\end{bmatrix}
\end{equation*}
\end{enumerate}

\begin{enumerate}
\item Draw 4 points on a graph representing a square. Multiply each point by this matrix. Make sure to label each point, and in the graph before and after. What happened to that square?
\begin{equation*}
\begin{bmatrix}
-1 & 0\\
0 & -1\\
\end{bmatrix}
\end{equation*}
\end{enumerate}

\subsection{Matrices Part 2}
\label{sec-9-3}
Part2: composing matrix transformations. Matrix multiplication
   SCALING \& ROTATING

Our matrix might have values such that it rotates, and scales the vector
\begin{equation*}
 \begin{bmatrix}
 0 & -2\\
 -2 & 0\\
 \end{bmatrix}
 \end{equation*}

Notice that this matrix will not only rotate our by 90 degrees, but it also scales it by 2. This is a really powerful idea, because it means we can pack multiple transformations into a single vector. 

Not only can we pack everything into one matrix, but we can add concatenate transformations into that matrix by multiplying N matrices together. So we may have a matrix that scales a vector. But then we ight 



\begin{equation*}
  v = 
  \begin{bmatrix}
  x \\
  y \\
  z \\
  \end{bmatrix}
\end{equation*}

Part 2: 
Homogeneous vector, and packing multiple transformations into a single matrix. 

Part 4: 3D transformations

\subsection{Solving equations}
\label{sec-9-4}
We can take multiple equations, put the coefficients into a matrix, and the variables into the input vector, and the righthandside of the equations into the output vector.

To solve this we need to find which input vector this matrix maps to the output vector. We get this by applying the inverse matrix to the output vector.
Finding an inverse of an arbitrary matrix is expensive. 

\begin{equation*}
A = 
\begin{bmatrix}
1 & 2 & 3 \\
4 & 5 & 6 \\
7 & 8 & 9
\end{bmatrix}
\end{equation*}
\subsection{Eigenvector}
\label{sec-9-5}
Any vector which is only scaled when multiplied by a matrix M is called an Eigenvector of that matrix. How much its scaled by is called the Eigenvalue
\section{3D geometry}
\label{sec-10}
Planes
Line
Rays
Vertices
Collision Detection: point-shape, line-shape, line-line, shape-shape intersection. Closest points on line, on shape
\section{Calculus}
\label{sec-11}
Limits
Derivative
Integral
Fundamental Theorem of Calculus
\section{Discrete Mathematics}
\label{sec-12}
Games simulate continuous motion by displaying a series of discrete frames quickly. Everything that happens in a game, under the hood, is discrete. We simulate at time t, then draw the results, then simulate at time t2. Even tho the equation may be continuous, we are simulating it in discrete chunks. 
Example: if an object is moving to the right with velocity 60, and our FPS is 60, then it will move 1 unit every frame. That means if we frame-stepped our game we would see it teleport between coordinate 0 \& 1, 1 \& 2, etectera
This does not seem to be the way the world really works (?)
\section{Algorithms}
\label{sec-13}
In programming we are making defining processes that happen over time. The description or rules of a process are called an algorithm. We're all familiar with algorithms in our daily life: how to bake a cake is an algorithm because it gives instructions of what steps to execute to produce the desired output. 

Thinking in terms of algorithms is important for game programmers because we are dealing with complex systems and the desired outcome is ususally many steps away. Math is one of the tools we use to describe the operations we want to perform, but it is ususally not as simple as doing one thing. 

Example: you have an NPC who you want to rotate to face an object. You can describe mathematically how much you want him to turn. You can even describe how much you want him to turn every frame, so that it happens over time. But you also need to figure out when he should start facing an object; for how long he should face it; how he picks the object to face, and so on.

There are a two basic tools that programmers use to create algorithms.

\begin{description}
\item[{Conditionals}] This is a way to specify if some instruction should be carried out based on a condition being satisfied (meaning that it is true). Usually these are written using "if" and "else". 

\textbf{Example}: In a recipe you don't put the cake in the oven until the temperature is 400 degrees.

\item[{Loops}] This is a way to specify that we want an instruction carried out N times, or until a certain condition is satisfied.

\textbf{Example 1}: take 3 eggs and crack them into a bowl. 

\textbf{Example 2}: 
\begin{enumerate}
\item Put a slice of bacon in the pan.
\item \emph{IF} there is room, goto step 1)
\end{enumerate}
\end{description}

Often we will write algorithms with numbers next to the step so that we can refer to a step with a number, and issue instructions like "goto intsruction N".

Let's look at an example of a cake recipe to see an algorithm:

\begin{enumerate}
\item Get a bowl, 3 eggs, flour, sugar, and butter
\item \emph{LOOP}:
\begin{itemize}
\item Take an egg and put in the bowl
\item \emph{IF} there are less than 3 eggs in the bowl, goto step 2)
\end{itemize}
\item Put 2 cups of flower in the bowl.
\item Put 1 stick of butter in the bowl.
\item Preheat the oven to 400 degrees.
\item \emph{IF} the oven is not 400 degrees, goto step 8)
\item Put the bowl in the oven.
\item Wait.
\item \emph{IF} it has been 30 minutes, goto step 10). \emph{ELSE} goto step 8)
\item Take the cake out of the oven.
\end{enumerate}

An algorithm that underlies all games is this:

\begin{enumerate}
\item \emph{LOOP}:
\begin{itemize}
\item GetInput()
\item Simulate()
\item Render()
\item \emph{IF} game-over goto 2)
\item \emph{ELSE} goto step 1)
\end{itemize}
\item Close the game.
\end{enumerate}

\begin{verbatim}
int main() {
    printf("Hello World 0123");
}
\end{verbatim}
\section{Probability}
\label{sec-14}
  LOST ALL THIS DATA FUCK!
\{this is the only example I've found where P(A | B) doesn't just wind up being P(A). The fact that they are almost always the same is really not intuitive to me. \}
