math_syllabus.org
** Problems
   Given a card-game find how many copies of cards you're allowed to have in a deck if you want the probability of drawing that card to be N

   Find the probabilities of the different hands in poker. 
   How would you change the rules to increase the probability of getting certain hands?
   How about increasing the probability gap between the lower tier and higher tier hands (like let's say you want 30% chance of a low-tier hand, but a 1% chance of getting the highest hand)

* Quotes
  In my opinion, everything happens in nature in a mathematical way. 
  
  -- Renes Descarte



  Counting is the religion of this generation it is its hope and its salvation.
  
  -- Gertrude Stein



  "If you manage to look closely enough at this simulation function, you will always inevitably find some point, actually many points, where the implementation actually happens in the universe, and not from the programmer. And what the programmer has managed to do is encapsulate a bunch of these little things that the universe does until he has built up a bigger structure."
  
  -- Jonathan Blow
* Vocabulary
  Analogy
  
  Metaphor
  
  Parallel
  
  Horizontal
  
  Vertical

